Tekla Open API Reference for Tekla Structures 2025
Polymesh.ConvertToStruct Method
 Converts a
FacetedBrep
 to struct dot polymesh.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static void ConvertToStruct(
	FacetedBrep brep,
	ref dotPolymesh_t output
)
Public Shared Sub ConvertToStruct (
	brep As FacetedBrep,
	ByRef output As dotPolymesh_t
)
Parameters
brep
Type: Tekla.Structures.Geometry3d.FacetedBrep
The input brep polymesh
output
Type: dotPolymesh_t
The output dot polymesh
Return Value
Type:
The converted polymesh instances
See Also
Reference
Polymesh Class
Tekla.Structures.Model Namespace